; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 12 parts and 150% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    blue mauve green white black red - acolour
    oak teak walnut - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - part
    b0 b1 b2 b3 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 red)
    (has-colour glazer0 natural)
    (has-colour glazer1 white)
    (has-colour glazer1 natural)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher0 red)
    (has-colour immersion-varnisher1 white)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher0 red)
    (has-colour spray-varnisher1 white)
    (unused p0)
    (goalsize p0 medium)
    (= (spray-varnish-cost p0) 10)
    (= (glaze-cost p0) 15)
    (= (grind-cost p0) 30)
    (= (plane-cost p0) 20)
    (unused p1)
    (goalsize p1 large)
    (= (spray-varnish-cost p1) 15)
    (= (glaze-cost p1) 20)
    (= (grind-cost p1) 45)
    (= (plane-cost p1) 30)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (available p3)
    (treatment p3 varnished)
    (surface-condition p3 rough)
    (wood p3 teak)
    (colour p3 black)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (unused p4)
    (goalsize p4 medium)
    (= (spray-varnish-cost p4) 10)
    (= (glaze-cost p4) 15)
    (= (grind-cost p4) 30)
    (= (plane-cost p4) 20)
    (unused p5)
    (goalsize p5 small)
    (= (spray-varnish-cost p5) 5)
    (= (glaze-cost p5) 10)
    (= (grind-cost p5) 15)
    (= (plane-cost p5) 10)
    (unused p6)
    (goalsize p6 small)
    (= (spray-varnish-cost p6) 5)
    (= (glaze-cost p6) 10)
    (= (grind-cost p6) 15)
    (= (plane-cost p6) 10)
    (unused p7)
    (goalsize p7 large)
    (= (spray-varnish-cost p7) 15)
    (= (glaze-cost p7) 20)
    (= (grind-cost p7) 45)
    (= (plane-cost p7) 30)
    (available p8)
    (treatment p8 colourfragments)
    (surface-condition p8 smooth)
    (wood p8 teak)
    (colour p8 black)
    (goalsize p8 large)
    (= (spray-varnish-cost p8) 15)
    (= (glaze-cost p8) 20)
    (= (grind-cost p8) 45)
    (= (plane-cost p8) 30)
    (available p9)
    (treatment p9 glazed)
    (surface-condition p9 smooth)
    (wood p9 teak)
    (colour p9 green)
    (goalsize p9 small)
    (= (spray-varnish-cost p9) 5)
    (= (glaze-cost p9) 10)
    (= (grind-cost p9) 15)
    (= (plane-cost p9) 10)
    (unused p10)
    (goalsize p10 small)
    (= (spray-varnish-cost p10) 5)
    (= (glaze-cost p10) 10)
    (= (grind-cost p10) 15)
    (= (plane-cost p10) 10)
    (unused p11)
    (goalsize p11 large)
    (= (spray-varnish-cost p11) 15)
    (= (glaze-cost p11) 20)
    (= (grind-cost p11) 45)
    (= (plane-cost p11) 30)
    (boardsize b0 s8)
    (wood b0 teak)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s6)
    (wood b1 teak)
    (surface-condition b1 smooth)
    (available b1)
    (boardsize b2 s9)
    (wood b2 walnut)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s5)
    (wood b3 oak)
    (surface-condition b3 rough)
    (available b3)
  )
  (:goal
    (and
    (available p0)
    (treatment p0 varnished)
    (wood p0 teak)
    (surface-condition p0 verysmooth)
    (colour p0 white)
    (available p1)
    (colour p1 white)
    (wood p1 teak)
    (available p2)
    (colour p2 red)
    (surface-condition p2 verysmooth)
    (available p3)
    (treatment p3 varnished)
    (colour p3 white)
    (surface-condition p3 smooth)
    (available p4)
    (treatment p4 glazed)
    (surface-condition p4 verysmooth)
    (available p5)
    (wood p5 teak)
    (colour p5 white)
    (available p6)
    (treatment p6 glazed)
    (wood p6 teak)
    (available p7)
    (treatment p7 varnished)
    (wood p7 oak)
    (available p8)
    (treatment p8 glazed)
    (colour p8 natural)
    (surface-condition p8 smooth)
    (available p9)
    (treatment p9 varnished)
    (wood p9 teak)
    (available p10)
    (treatment p10 varnished)
    (surface-condition p10 verysmooth)
    (available p11)
    (treatment p11 varnished)
    (surface-condition p11 smooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b0 p6 saw0 teak rough s8 s7)
   deleted: (unused p6)
   added: (available p6) (wood p6 teak) (surface-condition p6 rough) (colour p6 natural) (treatment p6 untreated) (boardsize b0 s7)
   goals met: 8 of 40
2. (do-saw-small b0 p5 saw0 teak rough s7 s6)
   deleted: (unused p5)
   added: (available p5) (wood p5 teak) (surface-condition p5 rough) (colour p5 natural) (treatment p5 untreated) (boardsize b0 s6)
   goals met: 10 of 40
3. (do-saw-medium b1 p4 saw0 teak smooth s6 s5 s4)
   deleted: (unused p4)
   added: (available p4) (wood p4 teak) (surface-condition p4 smooth) (colour p4 natural) (treatment p4 untreated) (boardsize b1 s4)
   goals met: 11 of 40
4. (do-saw-medium b1 p2 saw0 teak smooth s4 s3 s2)
   deleted: (unused p2)
   added: (available p2) (wood p2 teak) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b1 s2)
   goals met: 12 of 40
5. (do-saw-medium b1 p0 saw0 teak smooth s2 s1 s0)
   deleted: (unused p0)
   added: (available p0) (wood p0 teak) (surface-condition p0 smooth) (colour p0 natural) (treatment p0 untreated) (boardsize b1 s0)
   goals met: 14 of 40
6. (do-saw-large b0 p1 saw0 teak rough s6 s4 s5 s3)
   deleted: (unused p1)
   added: (available p1) (wood p1 teak) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s3)
   goals met: 16 of 40
7. (do-plane p8 planer0 smooth black colourfragments)
   deleted: (treatment p8 colourfragments) (colour p8 black)
   added: (treatment p8 untreated) (colour p8 natural)
   goals met: 17 of 40
8. (do-grind p4 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p4 smooth)
   added: (surface-condition p4 verysmooth)
   goals met: 18 of 40
9. (do-grind p2 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p2 smooth)
   added: (surface-condition p2 verysmooth)
   goals met: 19 of 40
10. (do-grind p0 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p0 smooth)
   added: (surface-condition p0 verysmooth)
   goals met: 20 of 40
11. (do-glaze p8 glazer0 natural)
   deleted: (treatment p8 untreated)
   added: (treatment p8 glazed)
   goals met: 21 of 40
12. (do-glaze p6 glazer0 natural)
   deleted: (treatment p6 untreated)
   added: (treatment p6 glazed)
   goals met: 22 of 40
13. (do-glaze p5 glazer1 white)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 white)
   goals met: 23 of 40
14. (do-glaze p4 glazer0 natural)
   deleted: (treatment p4 untreated)
   added: (treatment p4 glazed)
   goals met: 24 of 40
15. (do-glaze p2 glazer0 red)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 red)
   goals met: 25 of 40
16. (do-glaze p1 glazer1 white)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 white)
   goals met: 26 of 40
17. (do-grind p9 grinder0 smooth green glazed untreated)
   deleted: (surface-condition p9 smooth) (treatment p9 glazed) (colour p9 green)
   added: (surface-condition p9 verysmooth) (treatment p9 untreated) (colour p9 natural)
   goals met: 26 of 40
18. (do-immersion-varnish p0 immersion-varnisher0 white verysmooth)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 varnished) (colour p0 white)
   goals met: 28 of 40
19. (do-immersion-varnish p9 immersion-varnisher0 red verysmooth)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 varnished) (colour p9 red)
   goals met: 29 of 40
20. (do-plane p3 planer0 rough black varnished)
   deleted: (surface-condition p3 rough) (treatment p3 varnished) (colour p3 black)
   added: (surface-condition p3 smooth) (treatment p3 untreated) (colour p3 natural)
   goals met: 29 of 40
21. (do-immersion-varnish p3 immersion-varnisher0 white smooth)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 varnished) (colour p3 white)
   goals met: 31 of 40
22. (do-saw-large b0 p11 saw0 teak rough s3 s1 s2 s0)
   deleted: (unused p11)
   added: (available p11) (wood p11 teak) (surface-condition p11 rough) (colour p11 natural) (treatment p11 untreated) (boardsize b0 s0)
   goals met: 32 of 40
23. (do-plane p11 planer0 rough natural untreated)
   deleted: (surface-condition p11 rough)
   added: (surface-condition p11 smooth)
   goals met: 33 of 40
24. (do-immersion-varnish p11 immersion-varnisher0 red smooth)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 varnished) (colour p11 red)
   goals met: 34 of 40
25. (do-saw-large b3 p7 saw0 oak rough s5 s3 s4 s2)
   deleted: (unused p7)
   added: (available p7) (wood p7 oak) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b3 s2)
   goals met: 36 of 40
26. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 36 of 40
27. (do-immersion-varnish p7 immersion-varnisher0 red smooth)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 varnished) (colour p7 red)
   goals met: 37 of 40
28. (do-saw-small b2 p10 saw0 walnut rough s9 s8)
   deleted: (unused p10)
   added: (available p10) (wood p10 walnut) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b2 s8)
   goals met: 38 of 40
29. (do-plane p10 planer0 rough natural untreated)
   deleted: (surface-condition p10 rough)
   added: (surface-condition p10 smooth)
   goals met: 38 of 40
30. (do-grind p10 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p10 smooth)
   added: (surface-condition p10 verysmooth)
   goals met: 39 of 40
31. (do-immersion-varnish p10 immersion-varnisher0 red verysmooth)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 varnished) (colour p10 red)
   goals met: 40 of 40
